export function getMockData() {
  return {
    data: [
      {
        name: '米饭',
        calorie: 116,
        imgUrl:
          'https://tva1.sinaimg.cn/large/e6c9d24ely1h1maf19dtjj20go0gomxi.jpg',
        intro:
          '米饭是中国、乃至东亚、东南亚人民喜爱的一种主食，是用大米和适量的水蒸或焖熟而成的食物。米饭，又称白饭，或简称饭。是一种把稻米与水煮成的食物。米饭是中国、日本和韩国等东亚地区最主要的粮食。米饭的制法为一杯米加一杯半到一杯的水，煮出来的米适当的膨胀，里面全熟，去除水份后即成。在香港的酒楼和茶餐厅，白饭亦有俗称为靓仔，来源已不可考。',
      },
      {
        name: '全麦面包',
        calorie: 254,
        imgUrl:
          'https://tva1.sinaimg.cn/large/e6c9d24ely1h1mafmy57hj20go0goq3k.jpg',
        intro:
          '全麦面包是指用没有去掉外面麸皮和胚芽的全麦面粉制作的面包，有别于用精白面粉（即麦粒去掉麸皮胚芽）制作的一般面包。麸皮部分富含B族维生素、蛋白质和膳食纤维，但质地粗糙，口感不佳。只有含胚芽、胚乳和麸皮三部分的面粉才是真正的全麦粉，其色黑、质粗、肉眼可见麸皮，使用时要与一定比例的精白面粉混合，保质期较短。全麦面包使用的全麦面粉因为经过较少的加工程序，因此保留了大部分的营养元素。它含有丰富的粗纤维、维生素E和B族维生素，锌、钾等矿物质含量也很丰富，比普通面包更易发霉变质，购买后一定要妥善保存，最好即买即食。',
      },
      {
        name: '紫薯',
        calorie: 133,
        imgUrl:
          'https://tva1.sinaimg.cn/large/e6c9d24ely1h1maglqe2vj20go0gojs4.jpg',
        intro:
          '紫薯（Ipomoea batatas (L.) Lam），属旋花科番薯属草本植物，薯肉呈紫色至深紫色，故又称黑薯、紫心甘薯或紫肉甘薯。紫薯是甘薯的一个特殊品种类型，兼有粮食物、经济作物和药用作物的特点，除了具有普通甘薯的成分和功能外，还具有多种生理作用，是食品、医药、化工、轻工、纺织等工业的重要原料。紫薯含Se、Zn、Fe、P等10多种矿物元素，含有18种氨基酸，富含维生素C、B、A等8种维生素，特别是含有大量药用价值的花青素。',
      },
      {
        name: '小米粥',
        calorie: 46,
        imgUrl:
          'https://tva1.sinaimg.cn/large/e6c9d24ely1h1magxnmilj20go0goaa6.jpg',
        intro:
          '小米粥是以小米作为主要食材熬制的粥点，小米粥对胃黏膜具有保护作用， [6]  口味清淡，清香味，具有简单易制，健胃消食的特点。煮粥时一定要先烧开水然后放入洗净后的小米，先煮沸，然后用文火熬，汤粘稠后即可关火。小米是传统健康食品，可单独焖饭和熬粥。在北方，小米是主要食物之一，很多地区有晚餐吃小米粥的习俗。小米营养丰富，但是和其它谷物一样蛋白质中赖氨酸过低，可以在粥中搭配红薯、藜麦、豆类、枣、南瓜、龙眼、桂圆等各类食材，既增加营养又增加口感。',
      },
      {
        name: '小笼包',
        calorie: 240,
        imgUrl:
          'https://tva1.sinaimg.cn/large/e6c9d24ely1h1maw9g1d8j20dw09baal.jpg',
        intro:
          '小笼包，本称小笼馒头，是中国著名的汉族传统面点小吃，最早出现于清代同治年间的江苏省常州府一带。在江浙一带习惯叫做小笼馒头，四川、芜湖叫做“小笼包子”，武汉叫做“小笼包”，一个蒸笼里有10个包子，10个包子为一笼。汤包源于北宋京城开封的灌汤包，现代形式的小笼包起源于江南，后又在各地得到发展和演变，形成不同的口味。小笼包是无锡、常州、苏州、南京、上海、杭州、宁波、嘉兴等地的传统小吃。清代道光年间出现了现代形式的小笼包，并在各地都形成了各自的特色，如常州味鲜、南京味清、无锡味甜，但都具有皮薄卤足、鲜香美味等共同特点，并在开封、天津等地也得到了传扬。',
      },
    ],
  }
}
